In [ ]:
import pandas as pd

In [221]:
books = pd.read_csv("books.csv")

In [242]:
borrows = pd.read_csv("borrows.csv")

In [243]:
books['BookID'] = books.index

In [244]:
books.head()

,Title,Author,Genre,Height,Publisher,BookID
0,Fundamentals of Wavelets,"Goswami, Jaideva",signal_processing,228,Wiley,0
1,Data Smart,"Foreman, John",data_science,235,Wiley,1
2,God Created the Integers,"Hawking, Stephen",mathematics,197,Penguin,2
3,Superfreakonomics,"Dubner, Stephen",economics,179,HarperCollins,3
4,Orientalism,"Said, Edward",history,197,Penguin,4

In [245]:
borrows.head()

   StudentID  BookID
0          1     208
1          1      98
2          1      18
3          1     114
4          1       8

In [247]:
df = borrows.merge(books, on="BookID")

In [248]:
df['borrowed'] = 1

In [249]:
df

,StudentID,BookID,Title,Author,Genre,Height,Publisher,borrowed
0,1,208,Animal Farm,"Orwell, George",fiction,180,NaN,1
1,2,208,Animal Farm,"Orwell, George",fiction,180,NaN,1
2,9,208,Animal Farm,"Orwell, George",fiction,180,NaN,1
3,1,98,"Age of Discontuinity, The","Drucker, Peter",economics,178,Random House,1
4,2,98,"Age of Discontuinity, The","Drucker, Peter",economics,178,Random House,1
...,...,...,...,...,...,...,...,...
76,10,15,"Trial, The","Kafka, Frank",fiction,198,Random House,1
77,10,11,Slaughterhouse Five,"Vonnegut, Kurt",fiction,198,Random House,1
78,10,38,"Last Lecture, The","Pausch, Randy",nonfiction,197,Hyperion,1
79,10,40,Jurassic Park,"Crichton, Michael",fiction,174,Random House,1
80,10,150,Batman: The Long Halloween,NaN,comic,258,NaN,1

In [258]:
matrix = df.pivot_table(index='StudentID', columns='Title', values='borrowed')

In [259]:
matrix

Title,"Age of Discontuinity, The","Age of Wrath, The",All the President's Men,Animal Farm,"Argumentative Indian, The",Batman: The Long Halloween,Beyond the Three Seas,Bookless in Baghdad,"Case of the Lame Canary, The",Data Smart,...,Scoop!,Slaughterhouse Five,Structure & Interpretation of Computer Programs,Superfreakonomics,To Sir With Love,"Trial, The",Urlasurla,"Veteran, The","World's Greatest Short Stories, The","World's Greatest Trials, The"
StudentID,,,,,,,,,,,,,,,,,,,,,
1,1.0,NaN,NaN,1.0,NaN,NaN,1.0,NaN,NaN,1.0,...,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
2,1.0,1.0,1.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
4,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,1.0,NaN,NaN,1.0,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,1.0,NaN,NaN,1.0,1.0,NaN
9,1.0,NaN,NaN,1.0,NaN,NaN,NaN,NaN,1.0,NaN,...,1.0,NaN,1.0,NaN,NaN,NaN,NaN,1.0,NaN,NaN
10,NaN,NaN,1.0,NaN,NaN,1.0,NaN,NaN,NaN,NaN,...,1.0,1.0,NaN,NaN,NaN,1.0,1.0,1.0,NaN,NaN

In [358]:
user_similarity = cosine_similarity(matrix.fillna(0))
user_similarity

array([[1.        , 0.35355339, 0.        , 0.11111111, 0.        ,
        0.        , 0.2981424 , 0.27216553, 0.28867513, 0.0860663 ],
       [0.35355339, 1.        , 0.40089186, 0.23570226, 0.        ,
        0.        , 0.        , 0.14433757, 0.40824829, 0.36514837],
       [0.        , 0.40089186, 1.        , 0.37796447, 0.        ,
        0.        , 0.16903085, 0.        , 0.43643578, 0.29277002],
       [0.11111111, 0.23570226, 0.37796447, 1.        , 0.33333333,
        0.        , 0.2981424 , 0.        , 0.19245009, 0.43033148],
       [0.        , 0.        , 0.        , 0.33333333, 1.        ,
        0.        , 0.2236068 , 0.        , 0.        , 0.25819889],
       [0.        , 0.        , 0.        , 0.        , 0.        ,
        1.        , 0.25819889, 0.        , 0.16666667, 0.        ],
       [0.2981424 , 0.        , 0.16903085, 0.2981424 , 0.2236068 ,
        0.25819889, 1.        , 0.        , 0.38729833, 0.11547005],
       [0.27216553, 0.14433757, 0.        , 0.        , 0.        ,
        0.        , 0.        , 1.        , 0.11785113, 0.31622777],
       [0.28867513, 0.40824829, 0.43643578, 0.19245009, 0.        ,
        0.16666667, 0.38729833, 0.11785113, 1.        , 0.2236068 ],
       [0.0860663 , 0.36514837, 0.29277002, 0.43033148, 0.25819889,
        0.        , 0.11547005, 0.31622777, 0.2236068 , 1.        ]])

In [359]:
user_similarity = pd.DataFrame(user_similarity, columns = [x for x in range(10)])

In [360]:
user_similarity

,0,1,2,3,4,5,6,7,8,9
0,1.000000,0.353553,0.000000,0.111111,0.000000,0.000000,0.298142,0.272166,0.288675,0.086066
1,0.353553,1.000000,0.400892,0.235702,0.000000,0.000000,0.000000,0.144338,0.408248,0.365148
2,0.000000,0.400892,1.000000,0.377964,0.000000,0.000000,0.169031,0.000000,0.436436,0.292770
3,0.111111,0.235702,0.377964,1.000000,0.333333,0.000000,0.298142,0.000000,0.192450,0.430331
4,0.000000,0.000000,0.000000,0.333333,1.000000,0.000000,0.223607,0.000000,0.000000,0.258199
5,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.258199,0.000000,0.166667,0.000000
6,0.298142,0.000000,0.169031,0.298142,0.223607,0.258199,1.000000,0.000000,0.387298,0.115470
7,0.272166,0.144338,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.117851,0.316228
8,0.288675,0.408248,0.436436,0.192450,0.000000,0.166667,0.387298,0.117851,1.000000,0.223607
9,0.086066,0.365148,0.292770,0.430331,0.258199,0.000000,0.115470,0.316228,0.223607,1.000000

In [361]:
# Pick a user ID
picked_userid = 1
# Remove picked user ID from the candidate list
user_similarity.drop(index=picked_userid, inplace=True)
# Take a look at the data
user_similarity.head()

,0,1,2,3,4,5,6,7,8,9
0,1.000000,0.353553,0.000000,0.111111,0.000000,0.0,0.298142,0.272166,0.288675,0.086066
2,0.000000,0.400892,1.000000,0.377964,0.000000,0.0,0.169031,0.000000,0.436436,0.292770
3,0.111111,0.235702,0.377964,1.000000,0.333333,0.0,0.298142,0.000000,0.192450,0.430331
4,0.000000,0.000000,0.000000,0.333333,1.000000,0.0,0.223607,0.000000,0.000000,0.258199
5,0.000000,0.000000,0.000000,0.000000,0.000000,1.0,0.258199,0.000000,0.166667,0.000000

In [362]:
# Number of similar users
n = 10
# User similarity threashold
user_similarity_threshold = 0.3
# Get top n similar users
similar_users = user_similarity[user_similarity[picked_userid]>user_similarity_threshold][picked_userid].sort_values(ascending=False)[:n]

# Print out top n similar users
print(f'The similar users for user {picked_userid} are\n', similar_users)

The similar users for user 1 are
 8    0.408248
2    0.400892
9    0.365148
0    0.353553
Name: 1, dtype: float64

In [363]:
df[df['StudentID'] == 1]

,StudentID,BookID,Title,Author,Genre,Height,Publisher,borrowed
0,1,208,Animal Farm,"Orwell, George",fiction,180,NaN,1
3,1,98,"Age of Discontuinity, The","Drucker, Peter",economics,178,Random House,1
6,1,18,"New Machiavelli, The","Wells, H. G.",fiction,180,Penguin,1
10,1,114,Rationality & Freedom,"Sen, Amartya",economics,213,Springer,1
12,1,8,Image Processing & Mathematical Morphology,"Shih, Frank",signal_processing,241,CRC,1
13,1,102,Beyond the Three Seas,"Dalrymple, William",history,197,Random House,1
14,1,1,Data Smart,"Foreman, John",data_science,235,Wiley,1
16,1,2,God Created the Integers,"Hawking, Stephen",mathematics,197,Penguin,1
19,1,3,Superfreakonomics,"Dubner, Stephen",economics,179,HarperCollins,1

In [364]:
df[df['StudentID'] == 8]

,StudentID,BookID,Title,Author,Genre,Height,Publisher,borrowed
8,8,18,"New Machiavelli, The","Wells, H. G.",fiction,180,Penguin,1
11,8,114,Rationality & Freedom,"Sen, Amartya",economics,213,Springer,1
66,8,36,"Veteran, The","Forsyth, Frederick",fiction,177,Transworld,1
69,8,103,"World's Greatest Short Stories, The",NaN,fiction,217,Jaico,1
70,8,119,To Sir With Love,Braithwaite,fiction,197,Penguin,1
71,8,51,In a Free State,"Naipaul, V. S.",fiction,196,Rupa,1

In [365]:
# Movies that the target user has watched
picked_userid_watched = matrix[matrix.index == picked_userid].dropna(axis=1, how='all')
picked_userid_watched

Title,"Age of Discontuinity, The",Animal Farm,Beyond the Three Seas,Data Smart,God Created the Integers,Image Processing & Mathematical Morphology,"New Machiavelli, The",Rationality & Freedom,Superfreakonomics
StudentID,,,,,,,,,
1,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0

In [366]:
# Movies that similar users watched. Remove movies that none of the similar users have watched
similar_user_movies = matrix[matrix.index.isin(similar_users.index)].dropna(axis=1, how='all')
similar_user_movies

Title,"Age of Discontuinity, The","Age of Wrath, The",All the President's Men,Animal Farm,"Case of the Lame Canary, The",Down and Out in Paris & London,God Created the Integers,In a Free State,Integration of the Indian States,Introduction to Algorithms,"New Machiavelli, The",O Jerusalem!,Orientalism,"Pillars of the Earth, The",Rationality & Freedom,Scoop!,Structure & Interpretation of Computer Programs,To Sir With Love,"Veteran, The","World's Greatest Short Stories, The"
StudentID,,,,,,,,,,,,,,,,,,,,
2,1.0,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0,NaN,1.0,1.0,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,NaN,1.0,NaN,NaN,NaN,1.0,NaN,NaN,1.0,1.0,1.0
9,1.0,NaN,NaN,1.0,1.0,1.0,1.0,NaN,1.0,1.0,NaN,NaN,1.0,1.0,NaN,1.0,1.0,NaN,1.0,NaN

In [367]:
# Remove the watched movie from the movie list
similar_user_movies.drop(picked_userid_watched.columns,axis=1, inplace=True, errors='ignore')
# Take a look at the data
similar_user_movies

Title,"Age of Wrath, The",All the President's Men,"Case of the Lame Canary, The",Down and Out in Paris & London,In a Free State,Integration of the Indian States,Introduction to Algorithms,O Jerusalem!,Orientalism,"Pillars of the Earth, The",Scoop!,Structure & Interpretation of Computer Programs,To Sir With Love,"Veteran, The","World's Greatest Short Stories, The"
StudentID,,,,,,,,,,,,,,,
2,1.0,1.0,NaN,NaN,NaN,1.0,NaN,1.0,NaN,NaN,1.0,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,1.0,1.0
9,NaN,NaN,1.0,1.0,NaN,1.0,1.0,NaN,1.0,1.0,1.0,1.0,NaN,1.0,NaN

In [375]:
item_score = {}

# Loop through items
for i in similar_user_movies.columns:
    # Get the ratings for movie i
    movie_rating = similar_user_movies[i]
    # create a variable to store the score
    total = 0
    # create a variable to store the number of scores
    count = 0
    # Loop through similar users
    for u in similar_users.index[0:-1]:
        # if the movie has rating
        if not pd.isna(movie_rating[u]):
            # Score is the sum of user similarity score mutiply by the movie rating
            score = similar_users[u] * movie_rating[u]
            # Add the score to the total score for the movie so far
            total += score
            # Add 1 to the count
            count += 1
            
    item_score[i] = total /count
    
# Convert dictionary to pandas dataframe
item_score = pd.DataFrame(item_score.items(), columns=['movie', 'movie_score'])
    
# Sort the movies by score
ranked_item_score = item_score.sort_values(by='movie_score', ascending=False)
# Select top m movies
m = 10
ranked_item_score.head(m)

                                  movie  movie_score
4                       In a Free State     0.408248
12                     To Sir With Love     0.408248
14  World's Greatest Short Stories, The     0.408248
0                     Age of Wrath, The     0.400892
1               All the President's Men     0.400892
7                          O Jerusalem!     0.400892
13                         Veteran, The     0.386698
5      Integration of the Indian States     0.383020
10                               Scoop!     0.383020
2          Case of the Lame Canary, The     0.365148

In [377]:
df[df['StudentID'] == 1]

,StudentID,BookID,Title,Author,Genre,Height,Publisher,borrowed
0,1,208,Animal Farm,"Orwell, George",fiction,180,NaN,1
3,1,98,"Age of Discontuinity, The","Drucker, Peter",economics,178,Random House,1
6,1,18,"New Machiavelli, The","Wells, H. G.",fiction,180,Penguin,1
10,1,114,Rationality & Freedom,"Sen, Amartya",economics,213,Springer,1
12,1,8,Image Processing & Mathematical Morphology,"Shih, Frank",signal_processing,241,CRC,1
13,1,102,Beyond the Three Seas,"Dalrymple, William",history,197,Random House,1
14,1,1,Data Smart,"Foreman, John",data_science,235,Wiley,1
16,1,2,God Created the Integers,"Hawking, Stephen",mathematics,197,Penguin,1
19,1,3,Superfreakonomics,"Dubner, Stephen",economics,179,HarperCollins,1